Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/applying_to_college/third_level_places_for_unemployed_people.html.txt.tmx
Source language: en
Languages: ga

source: If you are unemployed, you may want to continue your education or take part in a training course to develop your skills and improve your chances of getting back to work
ga: Má tá tú dífhostaithe, d’fhéadfadh go bhfuil tú ag iarraidh leanúint ar aghaidh le d’oideachas nó páirt a ghlacadh i gcúrsa oiliúna chun do scileanna a fhorbairt agus cur le do dheiseanna filleadh ar an obair

source: Springboard provides free higher education courses for people who are unemployed
ga: Cuireann Springboard cúrsaí ardoideachais ar fáil saor in aisce do dhaoine atá dífhostaithe

source: Most Springboard courses are part-time, but there is an increasing number of full-time courses available to certain participants
ga: Cúrsaí páirtaimseartha is ea formhór na gcúrsaí a sholáthraíonn Springboard, ach tá méadú ag teacht ar líon na gcúrsaí lánaimseartha atá ar fáil do rannpháirtithe áirithe

source: If Springboard doesn’t meet your needs, there are several other ways to go back to education
ga: Ta go leor bealaí ann inar féidir leat filleadh ar an oideachas

source: Springboard provides places for unemployed people on a range of part-time courses from certificate to master's degree levels - Levels 6 to 9 on the National Framework of Qualifications
ga: Cuireann Lingchlár áiteanna ar fáil do dhaoine dífhostaithe ar réimse cúrsaí páirtaimseartha, ó leibhéil teastais go dtí leibhéil na céime máistreachta – Leibhéil 6-9 ar an gCreat Náisiúnta Cáilíochtaí

source: Most of the courses last for one year or less
ga: Maireann an chuid is mó de na cúrsaí bliain amháin nó níos giorra

source: Courses are offered in information and communications technology (ICT), the green economy, pharmaceuticals, and international financial services
ga: Tá cúrsaí ar tairiscint i dteicneolaíocht faisnéise agus cumarsáide (TFC), an geilleagar glas, cógaisíocht agus seirbhísí airgeadais idirnáisiúnta

source: Programmes are also available in cross-enterprise skills and international selling
ga: Anuas air sin, tá fáil ar chláir i scileanna trasfhiontair agus díol idirnáisiúnta

source: Most of the courses start in September
ga: Cuirtear tús le formhór na gcúrsaí i mí Mheán Fómhair

source: Details on courses available and eligibility are on springboardcourses.ie
ga: Tá fáil ar shonraí ar na cúrsaí atá ar fáil agus ar incháilitheacht ar springboardcourses.ie

source: In general, in order to qualify for Springboard you must be unemployed, with a previous history of employment, and you must be actively seeking work and available to take up work. There are also residency criteria for certain participants not getting a social welfare payment
ga: Go ginearálta, d’fhonn cáiliú do Lingchlár, ní mór duit bheith dífhostaithe, stair fostaíochta roimhe seo a bheith agat, agus ní mór duit bheith sa tóir go gníomhach ar obair agus fáil bheith ort chun tabhairt faoi obair

source: At the time of starting a Springboard course, you must either be getting a qualifying social welfare payment or be in one of the other eligible categories listed below
ga: Nuair a chuireann tús le cúrsaí Lingchláir, ní mór duit íocaíocht cháilitheach leasa shóisialaigh a bheith á fáil agat nó bheith i gceann de na catagóirí incháilitheachta a liostaítear thíos

source: The qualifying social welfare payments are:
ga: Is iad na híocaíochtaí cáilitheacha leasa shóisialaigh:

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: • Widow's, Widower's or Surviving Civil Partner’s (Non-Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: You can also apply for Springboard if:
ga: Ina theannta sin, féadfaidh tú iarratas a dhéanamh ar Lingchlár, má:

source: • You were formerly self-employed, but are now unemployed and actively seeking work, even if you are not getting a social welfare payment
ga: • Bhí tú féinfhostaithe roimhe seo, ach anois tá tú dífhostaithe agus ag dul sa tóir go gníomhach ar obair, fiú mura bhfuil íocaíocht leasa shóisialaigh á fáil agat

source: • You are a qualified adult of working age (under 66) on someone else’s social welfare payment
ga: • Is duine fásta cáilithe thú atá in aois oibre (faoi 66) ar íocaíocht leasa shóisialaigh dhuine eile

source: • You are signing for social insurance credits
ga: • Tá síniú á dhéanamh agat le haghaidh creidmheasanna árachais shóisialta

source: • You are a homemaker with a previous history of employment
ga: • Tá tú ag oibriú go gearrthéarmach agus tá íocaíocht chuardaitheora poist á fáil agat

source: You are also eligible for Springboard (with approval from a Department of Social Protection Facilitator) if you are on one of the following schemes or payments:
ga: Sa mhullach air sin, tá tú i dteideal cur isteach ar Lingchlár (le cead ó Éascaitheoir na Roinne Coimirce Sóisialaí) má tá ceann de na híocaíochtaí a leanas á fáil agat nó má tá tú rannpháirteach i gceann de na scéimeanna a leanas:

source: • Back to Work Enterprise Allowance
ga: • An Liúntas Fiontraíochta um Fhilleadh ar Obair

source: If you take up a Springboard course, you can keep your existing social welfare payment if you continue to fulfil the conditions for the payment
ga: Má ghlacann tú le cúrsa Lingchláir, coimeádann tú d’íocaíocht leasa shóisialaigh má leanann tú le coinníollacha na híocaíochta a chomhlíonadh

source: You do not have to pay any course fees or charges while you are unemployed
ga: Níl ort aon táillí ná muirir chúrsa a íoc fad atá tú dífhostaithe

source: If you take up a job while on a course, Springboard will also fund the fees for the full academic year
ga: Má ghlacann tú le post fad atá cúrsa á dhéanamh agat, cuirfidh Lingchlár cistiú ar fáil do na táillí don bhliain acadúil iomlán

source: If your course extends into another academic year(s) the amount of fees payable will be a matter for your college to decide
ga: Má shíneann do chúrsa isteach i mbliain/mblianta eile, déanfaidh do choláiste an cinneadh faoin méid táillí a bheidh le híoc

source: If you are getting a jobseeker’s payment and participating on a part-time Springboard course you will continue to get your jobseeker’s payment under the Part-Time Education Option (PTEO)
ga: Más rud é go bhfuil tú ag fáil íocaíocht cuardaitheora poist agus go bhfuil páirt á glacadh agat i gcúrsa páirtaimseartha Springboard, leanfaidh tú le híocaíocht cuardaitheora poist a fháil faoi Rogha an Oideachais Pháirtaimseartha

source: If you are on a full-time Springboard course you will transfer to a Back to Education Allowance (BTEA) - you must meet the qualifying criteria for BTEA. If you have started a Springboard course and lose your qualifying social welfare payment you can continue on your course
ga: Má tá tú páirteach i scéim lánaimseartha Springboard, aistreofar thú chuig Liúntas chun Filleadh ar an Oideachas (BTEA) - ní mór duit na critéir cháilitheacha don BTEA a chomhlíonadh

source: To apply for a Springboard course, you choose the course(s) you are interested in on springboardcourses.ie and apply online, following the instructions on the website
ga: Chun iarratas a dhéanamh ar chúrsa Lingchláir, roghnaíonn tú an cúrsa/na cúrsaí ar spéis leat iad ar springboardcourses.ie agus déanann tú an t-iarratas ar líne, agus na treoracha ar an láithreán gréasáin a leanúint

source: If you are getting a social welfare payment, you should notify your Intreo Centre or local Social Welfare Branch Office and check what further steps (if any) you need to take
ga: Má tá íocaíocht leasa shóisialaigh á fáil agat, ba cheart duit d’oifig áitiúil leasa shóisialaigh a chur ar an eolas faoi seo agus seiceáil cén bearta breise atá le glacadh agat (más ann dóibh)

source: There are detailed Frequently Asked Questions on springboardcourses.ie
ga: Tá fáil ar Cheisteanna Coitianta ar springboardcourses.ie

source: You can also contact Springboard on Freephone 1800 303 523
ga: Is féidir glao a chur ar Springboard ar Saorghlao 1800 303 523
